Revit 2027 API
PerformanceAdviser.ExecuteRules(Document, IList<PerformanceAdviserRuleId>) Method
 Executes selected rules on a given document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<FailureMessage> ExecuteRules(
	Document document,
	IList<PerformanceAdviserRuleId> rules
)
Public Function ExecuteRules (
	document As Document,
	rules As IList(Of PerformanceAdviserRuleId)
) As IList(Of FailureMessage)
public:
IList<FailureMessage^>^ ExecuteRules(
	Document^ document,
	IList<PerformanceAdviserRuleId^>^ rules
)
member ExecuteRules :
        document : Document *
        rules : IList<PerformanceAdviserRuleId> -> IList<FailureMessage>
Parameters
document Document
 Document on which the rules will be executed.
rules IList<PerformanceAdviserRuleId>
 Ids of rules to be executed.
Return Value
IList<FailureMessage>
 Failure messages explaining performance problems detected in the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PerformanceAdviser Class
ExecuteRules Overload
Autodesk.Revit.DB Namespace